hzhsohn/xipp_project_mcu/stm32f105_v2_mcu1/user/main.c
#include "system_init.h"
#include "Stm32f1_uart1.h"
#include "Stm32f1_uart2.h"
#include "Stm32f1_uart3.h"
#include "InputDrive.h"
#include "mini-data.h"
#include "ds18b20.h"
#include "Stm32f1_ADC1.h"
#include "Stm32f1_ADC2.h"
#include "Motor_Diver.h"
#include "ds18b20_1.h"
#include "watchdog.h"
#include "flash_rw.h"
#include "Stm32F1_Timer2.h"
#include "Stm32F1_Timer3.h"
#include "key.h"
#include "OutputDrive.h"

//
extern u8_t kk,kk2;
extern int kk_1ms;
//
extern int jaopan;

//是否自动化操作
unsigned char g_isAutomation=1;

unsigned char g_cCleanCurrentSence=0;  

//场景时间调度
#define DEF_TIME_MS_DELAY		100

/**************/
//继电器逻辑重定义
int isOpenDry=0;


#define _unit1(x) 							RELAY1_STATE(x)			//吹气阀关  球形阀门
#define _unit2(x) 							RELAY2_STATE(x)			//吹气阀开  球形阀门
#define _unit3(x) 							RELAY3_STATE(x)			//排泄阀关  球形阀门
#define _unit4(x) 		 					RELAY4_STATE(x)			//排泄阀开  球形阀门
#define _unit5(x) 							RELAY5_STATE(x)			//冲水阀1  常闭阀门尿
#define _unit6(x) 							RELAY6_STATE(x)			//冲水阀2  常闭阀门冲斗
#define _unit7(x) 							RELAY7_STATE(x)			//冲水阀3  常闭阀门冲PP
#define _unit8(x) 				 			RELAY8_STATE(x) 		//杀菌器
#define _unit9(x) 							RELAY9_STATE(x)			//净化抽水
#define _unit10(x) 				 			RELAY10_STATE(x)		//吹气泵
#define _unit11(x)							RELAY11_STATE(x) 		//主抽水机
#define _unit12(x) 	 						RELAY12_STATE(x)		//气加热器
#define _unit13(x) 							RELAY13_STATE(x)		//水加热器  16A
#define _unit14(x) 	 						RELAY14_STATE(x)		//预留  220V
#define _unit15(x) 							RELAY15_STATE(x)		//抽吸机  220V


/**************/
//传感器逻辑重定义
#define cgqSewageHeight  					SENSOR1_STATE()?1:0 //污水满
#define cgqCleanWaterLow  				SENSOR2_STATE()?0:1 //清水低
#define cgqSewageSuitable  				SENSOR3_STATE()?1:0 //污水到位

//大小便检测
#define dxbPooPoo  				SENSOR4_STATE()?0:1    //屎
#define dxbXuXu	  				SENSOR5_STATE()?0:1    //尿

//--
//温度
int ntmp;
s16 rWaterTemperature=0,rWaterTemp=0,rGasTemperature=0,rGasTemp=0;
s16 rTrueWaterTemp=0,rTrueGasTemp=0;
int isWaterTooHot=0;
int isGasTooHot=0;
int isCheckWaterSensorErr=0; //水温防错误限制
int isCheckGasSensorErr=0;//水温防错误限制
int isCheckBedCQSensorErr=0;//气压防错误限制
int isCheckDZCQSensorErr=0;	//气压防错误限制

//气压
u16_t rPressure=0,rPressureTmp=0,rPressure2=0,rPressure2Tmp=0;
u16_t rTruePressure1=0,rTruePressure2=0;
//屎屎尿尿的防抖动
int rPoopoDD=0;
int rXuxuDD=0;
int pdxbPooPoo;
int pdxbXuXu;
//
int isTextPOPO=0;
int isTextXUXU=0;

//角度 
extern unsigned char jiaodu[2];
//脉博
unsigned char cHeartJump=0;
//污水满
char bSewageHeight=0;
//清水太少
char bCleanWaterLow=0;
//污水到位
char bSewageSuitable=0;
//工作时间设置
TagTimeingSetting g_tmeSetting={0};


//中断运行chart
int isCleanRuning=0;
int ppxxStep=0;

//摄像头电机
int xiiiLimit=90000;
int xiii=1000000;
int xiii2=1000000;
int Motor1_do_step=0;
int Motor2_do_step=0;
int motor1_p_or_n=0;
int motor2_p_or_n=0;
int monLimitState1L;
int monLimitState1R;
int monLimitState2L;
int monLimitState2R;


//按摩状态
static int anmiCurrentState=0;
static int baonianCurrentState=0;
//
void senceDelay(int*nCalca,int*ppxxStep,int jmpValue,int delay_ms,int ezhCleanSencePOS);

//
void LitteSenceRun(void);
/*
	ezhCleanSence1自动化小便																					
	ezhCleanSence2自动化大便 
	ezhCleanSence3护卫
	ezhCleanSence4冲洗
	ezhCleanSence5烘干
	ezhCleanSence6除菌
	ezhCleanSence7按摩
	ezhCleanSence8保暖
*/
void litteSenceRunPooPoo(void);
void litteSenceRunXuXu(void);
void litteSenceRunHuWai(void);
void litteSenceRunChongXi(void);
void litteSenceRunHongGan(void);
void litteSenceRunChuQun(void);
void litteSenceRunAnMo(void);
void litteSenceRunBaoNang(void);

//关闭所有输出
void allSenceClose()
{
		isOpenDry=0;
		jaopan=0;
		//
	 _unit1(0); 								
	 _unit2(0); 					
	 _unit3(0); 					
	 _unit4(0); 		 					
	 _unit5(0); 						
	 _unit6(0); 							
	 _unit7(0); 							
	 _unit8(0); 				 	
	 _unit9(0); 								
	 _unit10(0); 				 		
	 _unit11(0);					
	 _unit12(0); 	 						
	 _unit13(0);
	 _unit14(0); 
	 _unit15(0); 	
}

//中断场景
void allOutClose()
{	
		isCleanRuning=0;
		allSenceClose();
		isTextPOPO=0;
		isTextXUXU=0;
}
////////////////////////////////////////////////////////////////
//场景延时
void senceDelay(int*nCalca,int*ppxxStep,int jmpValue,int delay_ms,int ezhCleanSencePOS)
{
	if((*nCalca) > delay_ms) 
	{
			*nCalca=0;
			(*ppxxStep)++; g_cCleanCurrentSence=ezhCleanSencePOS;
	}
	else
	{
			if(0==isCleanRuning)//中断
			{g_cCleanCurrentSence=0;(*nCalca)=0;allOutClose();}
			(*nCalca)+=jmpValue;
	}
}
////////////////////////////////////////////////////////////////

//提交当前状态
void aurtEventStatus()
{
		uchar dst_buf[50]={0};
		unsigned char cbuf[23]={0};
		int myDataLen=0;
		//
		cbuf[0]=0;
		
		cbuf[1]=g_isAutomation;
		cbuf[2]=g_cCleanCurrentSence;
				
		cbuf[3]=bSewageHeight;//传感器污水满
		cbuf[4]=bCleanWaterLow;//传感器清水太小
		cbuf[5]=bSewageSuitable;//传感器污水管未安装到位
		
		cbuf[6]=cHeartJump; //脉博
		cbuf[7]=0;
		
		cbuf[8]=rTrueWaterTemp&0xff; //水温度
		cbuf[9]=rTrueWaterTemp>>8;
		
		cbuf[10]=rTrueGasTemp&0xff; //气温度
		cbuf[11]=rTrueGasTemp>>8;
		
		cbuf[12]=rTruePressure1&0xff; //裤档气压
		cbuf[13]=rTruePressure1>>8;
		
		cbuf[14]=rTruePressure2&0xff; //床垫气压
		cbuf[15]=rTruePressure2>>8;
		
		cbuf[16]=isWaterTooHot;//如果为1就是有问题,意思就是"加热功能不知道哪里有问题.."
		cbuf[17]=isGasTooHot;
		
		myDataLen = miniDataCreate(20,cbuf,dst_buf);
		STM32F1_UART1SendDataS(dst_buf,myDataLen);
		
		//
		cHeartJump=0;
}

void aurtEventBtn(int i)
{
		uchar dst_buf[10]={0};
		int myDataLen=0;
		unsigned char cbuf[5]={0};
		cbuf[0]=0x01;
		cbuf[1]=i;
		myDataLen = miniDataCreate(2,cbuf,dst_buf);
		STM32F1_UART1SendDataS(dst_buf,myDataLen);
}

void aurtEventUnitSence(EzhCleanSence i,int isEnable)
{
		/*
			1//继电器抽吸启用
			2//继电器烘干启用
			3//继电器除菌启用
			4//继电器大便启用
			5//继电器大便冲洗启用
			6//继电器小便启用
			7//继电器小便冲洗启用
		*/
		uchar dst_buf[50]={0};
		int myDataLen=0;
		unsigned char cbuf[5]={0};
		cbuf[0]=0x02;
		cbuf[1]=i;
		cbuf[2]=isEnable;
		myDataLen = miniDataCreate(3,cbuf,dst_buf);
		STM32F1_UART1SendDataS(dst_buf,myDataLen);
}

//显示信息指令
void aurtEventUnitShow(int i)
{
		uchar dst_buf[50]={0};
		int myDataLen=0;
		unsigned char cbuf[5]={0};
		cbuf[0]=0x03;
		cbuf[1]=i&0xff;
		cbuf[2]=(i>>8)&0xff;
		cbuf[3]=(i>>16)&0xff;
		cbuf[4]=(i>>24)&0xff;
		myDataLen = miniDataCreate(5,cbuf,dst_buf);
		STM32F1_UART1SendDataS(dst_buf,myDataLen);
}

void setFlashData()
{
	char binFlag[4]={0};
	FLASH_ReadByte(STARTADDRFLAG ,(uint8_t*)binFlag,4);
	FLASH_ReadByte(STARTADDR ,(uint8_t*)&g_tmeSetting,sizeof(g_tmeSetting));
	
