hzhsohn/xipp_project_mcu/stm32f105_v2_mcu1/user/main.c
	if(!(binFlag[0]=='a' && binFlag[1]=='b' && binFlag[2]=='c' && binFlag[3]=='d'))
	{
			binFlag[0]='a';
			binFlag[1]='b';
			binFlag[2]='c';
			binFlag[3]='d';

			//初始化FLASH内容
			g_tmeSetting.pooDelay=1;					  //拉屎后多少秒启动 ,单位分钟
			g_tmeSetting.xuxuDelay=10;				  //拉屎后多少秒启动 ,单位秒
			g_tmeSetting.pooFlush=30;					  //屎屎冲洗  ,	单位秒
			g_tmeSetting.xuxuFlush=10;				  //尿尿冲洗  	单位 秒
			g_tmeSetting.pooDry=2;      		  	//屎屎烘干时间 单位 分钟
			g_tmeSetting.xuxuDry=1;					  	//尿尿烘干时间 单位 分钟
			g_tmeSetting.pooSterilize=10;			  //屎屎消毒时间 单位 秒
			g_tmeSetting.xuxuSterilize=10;		  //尿尿消毒时间 单位 秒
			g_tmeSetting.crotchPressure=13;			//裤档气压 单位 100电压变数
			g_tmeSetting.bedPressure=13;   			//床垫的气压  单位 100电压变数
			g_tmeSetting.waterTemperature=38;		//最低水温   			单位摄氏度
			g_tmeSetting.airTemperature=50;  		//最低烘干温度   	单位摄氏度
			g_tmeSetting.mpuLeft=30;  					//
			g_tmeSetting.mpuRight=30;  					//
				
			FLASH_WriteByte(STARTADDRFLAG,(uint8_t*)binFlag,4);
			FLASH_WriteByte(STARTADDR,(uint8_t*)&g_tmeSetting,sizeof(g_tmeSetting));

	}
}
int main(void)
{
	EzhKeyEvent ev;
  EzhKeyState GPIOAStatus1;
	EzhKeyState GPIOAStatus2;
	EzhKeyState GPIOAStatus3;
	EzhKeyState GPIOAStatus4;
	EzhKeyState GPIOAStatus5;
	EzhKeyState GPIOAStatus6;
	EzhKeyState GPIOAStatus7;
	EzhKeyState GPIOAStatus8;
  zhSCM_initKeyState(&GPIOAStatus1);
	zhSCM_initKeyState(&GPIOAStatus2);
	zhSCM_initKeyState(&GPIOAStatus3);
	zhSCM_initKeyState(&GPIOAStatus4);
	zhSCM_initKeyState(&GPIOAStatus5);
	zhSCM_initKeyState(&GPIOAStatus6);
	zhSCM_initKeyState(&GPIOAStatus7);
	zhSCM_initKeyState(&GPIOAStatus8);
		
	STM32_Delay_init();
	STM32F1_UART1_Init(115200);
	STM32F1_UART2_Init(230400);
	STM32F1_UART3_Init(9600);
	
	DS18B20_Init();
	DS18B20_Init1();
	Adc_Init();
	Adc2_Init();	
	Motor_Init();
	Stm32F1_Timer2Init();
	Stm32F1_Timer3Init();
	InputDriveInit();
	OutputDriveInit();

	//-----------------------------------------
	//获取FALSH数据
	setFlashData();
  //-----------------------------------------

	//测试继电子器逻辑	
	#if 0
			allOutClose();
			RelayTest();
			allOutClose();
	#endif 
	
	//看门狗
	//watchdog_init();
	
	while(1)
	{
		//看门狗
		//watchdog_action();
		//
		pdxbPooPoo=dxbPooPoo;
		pdxbXuXu=dxbXuXu;
		//
		//---------------------
		//按键1		护卫键
		ev=zhSCM_keyState(&GPIOAStatus1,TOUCHKEY_1_GPIO,TOUCHKEY_1_PIN);
    switch(ev)
    {
			case ZH_KEY_EVENT_NONE:
				break;
      case ZH_KEY_EVENT_DOWN:
				break;
      case ZH_KEY_EVENT_PRESS:
				break;
      case ZH_KEY_EVENT_UP:
			{
					ppxxStep=0;
					if(!isCleanRuning && 0==g_cCleanCurrentSence)
					{
							aurtEventBtn(1);
							g_cCleanCurrentSence=ezhCleanSence3;
							isCleanRuning=1;
					}
					else
					{
							g_cCleanCurrentSence=0;
							isCleanRuning=0;
							allOutClose();
							aurtEventBtn(0);
					}
			}
       break;
    }
		//按键2		冲洗键
		ev=zhSCM_keyState(&GPIOAStatus2,TOUCHKEY_2_GPIO,TOUCHKEY_2_PIN);
    switch(ev)
    {
			case ZH_KEY_EVENT_NONE:
				break;
      case ZH_KEY_EVENT_DOWN:
        break;
      case ZH_KEY_EVENT_PRESS:
        break;
      case ZH_KEY_EVENT_UP:
			{
					ppxxStep=0;
					if(!isCleanRuning && 0==g_cCleanCurrentSence)
					{
							aurtEventBtn(2);
							g_cCleanCurrentSence=ezhCleanSence4;
							isCleanRuning=1;
					}
					else
					{
							g_cCleanCurrentSence=0;
							isCleanRuning=0;
							allOutClose();
							aurtEventBtn(0);
					}
			}
        break;
    }
		//按键3		烘干键
		ev=zhSCM_keyState(&GPIOAStatus1,TOUCHKEY_3_GPIO,TOUCHKEY_3_PIN);
    switch(ev)
    {
			case ZH_KEY_EVENT_NONE:
				break;
      case ZH_KEY_EVENT_DOWN:
				break;
      case ZH_KEY_EVENT_PRESS:
				break;
      case ZH_KEY_EVENT_UP:
			{
					ppxxStep=0;
					if(!isCleanRuning && 0==g_cCleanCurrentSence)
					{
							aurtEventBtn(3);
							g_cCleanCurrentSence=ezhCleanSence5;
							isCleanRuning=1;
					}
					else
					{
							g_cCleanCurrentSence=0;
							isCleanRuning=0;
							allOutClose();
							aurtEventBtn(0);
					}
			}
        break;
    }
		//按键4		除菌键
		ev=zhSCM_keyState(&GPIOAStatus2,TOUCHKEY_4_GPIO,TOUCHKEY_4_PIN);
    switch(ev)
    {
			case ZH_KEY_EVENT_NONE:
				break;
      case ZH_KEY_EVENT_DOWN:
        break;
      case ZH_KEY_EVENT_PRESS:
        break;
      case ZH_KEY_EVENT_UP:
			{
					ppxxStep=0;
					if(!isCleanRuning && 0==g_cCleanCurrentSence)
					{
							aurtEventBtn(4);
							g_cCleanCurrentSence=ezhCleanSence6;
							isCleanRuning=1;
					}
					else
					{
							g_cCleanCurrentSence=0;
							isCleanRuning=0;
							allOutClose();
							aurtEventBtn(0);
					}
			}
        break;
    }
		
		//按键5		按摩键
		ev=zhSCM_keyState(&GPIOAStatus1,TOUCHKEY_5_GPIO,TOUCHKEY_5_PIN);
    switch(ev)
    {
			case ZH_KEY_EVENT_NONE:
				break;
      case ZH_KEY_EVENT_DOWN:
				break;
      case ZH_KEY_EVENT_PRESS:
				break;
      case ZH_KEY_EVENT_UP:
			{
						ppxxStep=0;
						aurtEventBtn(5);
						g_cCleanCurrentSence=ezhCleanSence7;
						isCleanRuning=1;
						anmiCurrentState=!anmiCurrentState;
						ppxxStep=0; //复位场景
			}
        break;
    }
		//按键6		保暖键
		ev=zhSCM_keyState(&GPIOAStatus2,TOUCHKEY_6_GPIO,TOUCHKEY_6_PIN);
    switch(ev)
    {
			case ZH_KEY_EVENT_NONE:
				break;
      case ZH_KEY_EVENT_DOWN:
        break;
      case ZH_KEY_EVENT_PRESS:
        break;
      case ZH_KEY_EVENT_UP:
			{
						ppxxStep=0;
						aurtEventBtn(6);
						g_cCleanCurrentSence=ezhCleanSence8;
						isCleanRuning=1;
						baonianCurrentState=!baonianCurrentState;
						ppxxStep=0; //复位场景
			}
        break;
    }
		
		//按键7		设置链
		ev=zhSCM_keyState(&GPIOAStatus1,TOUCHKEY_7_GPIO,TOUCHKEY_7_PIN);
    switch(ev)
    {
			case ZH_KEY_EVENT_NONE:
				break;
      case ZH_KEY_EVENT_DOWN:
				break;
      case ZH_KEY_EVENT_PRESS:
				break;
      case ZH_KEY_EVENT_UP:
			{
					ppxxStep=0;
					aurtEventBtn(7);
			}
        break;
    }
		//按键8		待机开关
		ev=zhSCM_keyState(&GPIOAStatus2,TOUCHKEY_8_GPIO,TOUCHKEY_8_PIN);
    switch(ev)
    {
			case ZH_KEY_EVENT_NONE:
				break;
      case ZH_KEY_EVENT_DOWN:
        break;
      case ZH_KEY_EVENT_PRESS:
        break;
      case ZH_KEY_EVENT_UP:
			{
					ppxxStep=0;
					aurtEventBtn(8);
			}
        break;
    }

		//------------------------------------------------------------------
		//检测有无尿拉下来		
		//if(rTrueWaterTemp>=g_tmeSetting.waterTemperature*10) //限制如果水温不够不操作
		{
					if(dxbXuXu)
					{
						rXuxuDD++;
						if(rXuxuDD>2000)
						{
								if(0==g_cCleanCurrentSence && g_isAutomation)
								{
									aurtEventBtn(0x50);
									ppxxStep=0;
									g_cCleanCurrentSence=ezhCleanSence1;
									isCleanRuning=1;
								}
								rXuxuDD=0;
						}
					}
					else
					{
							rXuxuDD=0;
					}
		}
		//------------------------------------------------------------------
		//检测有没有屎掉下来
		//if(rTrueWaterTemp>=g_tmeSetting.waterTemperature*10)  //限制如果水温不够不操作
		{
					if(dxbPooPoo)
					{
						rPoopoDD++;
						if(rPoopoDD>2000)
						{
								if(0==g_cCleanCurrentSence && g_isAutomation)//场景执行中
								{
										aurtEventBtn(0x51);
										ppxxStep=0;
										g_cCleanCurrentSence=ezhCleanSence2;
										isCleanRuning=1;
								}
								rPoopoDD=0;
						}
					}
					else
					{
						rPoopoDD=0;
					}
		}

		//---------------------//
		if(kk>=10 && xiii>=xiiiLimit && xiii2>=xiiiLimit) //限制0.1秒执行一次,且步进电机不能有动作
		{
					//------------------------------------------------------------------
					//水温加热
					rWaterTemp=DS18B20_Get_Temp();
					if(rWaterTemp<2000 && rWaterTemp> -200) //限制位
					{
						ntmp=rWaterTemp-rWaterTemperature;
						if(ntmp<20 && ntmp>-20)	//限制突变幅度
						{
								isWaterTooHot=0;							
								if(rWaterTemp > 60*10) //加热器有问题了吧,太高了就是加热器有问题了.
								{
										//水太热了.发到串口告诉上位机端,通知护士小妹妹,机器故障了
										isWaterTooHot=1;
								}
								else if(rWaterTemp<g_tmeSetting.waterTemperature*10 && 0==bCleanWaterLow) //默认小于40度就加热
								{
										_unit13(1);
								}
								else
								{
										_unit13(0);
								}
								rTrueWaterTemp=rWaterTemp;
								isCheckWaterSensorErr=0;
						}
						rWaterTemperature=rWaterTemp;
					}
					else
					{
							isCheckWaterSensorErr++;						
							if(isCheckWaterSensorErr>10) //传感数据毛病太多关掉加热继电器
							{
								//传感器有毛病了.关掉继电器
								if(g_cCleanCurrentSence==0)
								{
											_unit13(0);
								}
							}
					}

					//-------------------------------------------------------------------
					//空气加热,实时条件限制
					rGasTemp=DS18B20_Get_Temp1(); 
					if(rGasTemp<2000 && rGasTemp> -200) //限制位
					{
						ntmp=rGasTemp-rGasTemperature;
						if(ntmp<20 && ntmp>-20) //限制突变幅度
						{
								isGasTooHot=0;							
								if(rGasTemp > 60*10) //加热器有问题了吧,太高了就是加热器有问题了.
								{
									//气温太热了.发到串口告诉上位机端,通知护士小妹妹,机器故障了
									isGasTooHot=1;
								}
								
