hzhsohn/xipp_project_mcu/stm32f105_v2_mcu1/user/main.c
								if(isOpenDry && rGasTemp<g_tmeSetting.airTemperature*10 ) //50度且烘开关的时候才处理
								{
									 _unit12(1);  //气加热单元
								}
								else
								{
									 _unit12(0);	//气加热单元
								}
								rTrueGasTemp=rGasTemp;
								isCheckGasSensorErr=0;
						}
						rGasTemperature=rGasTemp;
					}
					else
					{
						isCheckGasSensorErr++;						
						if(isCheckGasSensorErr>10) //传感数据有毛病关掉加热继电器
						{
								//传感器有毛病了.关掉继电器
								_unit12(0); //气加热单元
						}
					}

					//------------------------------------------------------------------
					//污水满
					if(cgqSewageHeight)
					{
							bSewageHeight=1;
					}
					else
					{
							bSewageHeight=0;
					}

					//------------------------------------------------------------------
					//清水太少
					if(cgqCleanWaterLow)
					{
							bCleanWaterLow=1;
					}
					else
					{
							bCleanWaterLow=0;
					}

					//------------------------------------------------------------------
					//污水不到位
					if(cgqSewageSuitable)
					{
							bSewageSuitable=1;
					}
					else
					{
							bSewageSuitable=0;
					}
					//---------------------
					kk=0;
		}
		
		//------------------------------------------------------------------
		//冲屎洗尿功能
		if(kk_1ms)
		{
					LitteSenceRun();
					kk_1ms=0;			
					//
					if(g_cCleanCurrentSence)
					{LED1_RE;LED2_RE;LED3_RE;}
					else 
					{LED1_ON;LED2_ON;LED3_ON;}
		}
	}
}

void LitteSenceRun()
{
		if(ezhCleanSence1==(g_cCleanCurrentSence)) //尿
		{
				litteSenceRunXuXu();
		}
		else if(ezhCleanSence2==(g_cCleanCurrentSence)) //屎
		{			
				litteSenceRunPooPoo();
		}
		else if(ezhCleanSence3==(g_cCleanCurrentSence))
		{
				litteSenceRunHuWai();
		}
		else if(ezhCleanSence4==(g_cCleanCurrentSence))
		{
				litteSenceRunChongXi();
		}
		else if(ezhCleanSence5==(g_cCleanCurrentSence))
		{
				litteSenceRunHongGan();
		}
		else if(ezhCleanSence6==(g_cCleanCurrentSence))
		{
				litteSenceRunChuQun();
		}
		else if(ezhCleanSence7==(g_cCleanCurrentSence))
		{
				litteSenceRunAnMo();
		}
		else if(ezhCleanSence8==(g_cCleanCurrentSence))
		{
				litteSenceRunBaoNang();
		}
		else
		{
				//没有场景
				g_cCleanCurrentSence=0;
		}
}


/*********************************************************

----运行场景----

***********************************************************/
void litteSenceRunXuXu()
{					
					static int nCalca=0;	
					switch(ppxxStep)
					{
						case 0:				
							allSenceClose();
							aurtEventUnitSence(ezhCleanSence1,1);
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*5,ezhCleanSence1);
							break;
						case 1:
							_unit4(1);
							_unit11(1);
							_unit5(1);
							break;
						case 2:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*3,ezhCleanSence2);
							break;
						case 3:
							_unit5(0);
							_unit6(1);
							break;
						case 4:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*4,ezhCleanSence2|ppxxStep);
							break;
						case 5:
							_unit6(0);
							_unit11(0);
							_unit15(1);
							_unit9(1);
							break;
						case 6:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*6,ezhCleanSence2);
							break;
						case 7:		
							_unit15(0);
							_unit9(0);
							_unit11(1);
							_unit6(1);
							break;
						case 8:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*6,ezhCleanSence2);
							break;
						case 9:		
							_unit11(0);
							_unit6(0);
							_unit2(1);
							_unit12(1);
							_unit10(1);
							break;
						case 10:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*50,ezhCleanSence2);
							break;
						case 11:		
							_unit2(0);
							_unit12(0);
							_unit10(0);
							_unit4(0);
							break;
						case 12:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*2,ezhCleanSence2);
							break;
						case 13:		
							_unit3(1);
							break;
						case 14:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*15,ezhCleanSence2);
							break;
						case 15:		
							_unit3(0);
							break;
						
						
						
						
						
						default: //完毕
							aurtEventUnitSence(ezhCleanSence1,0);
							allOutClose();
							g_cCleanCurrentSence=0;  		//场景复位
							ppxxStep=0;
							break;
					}
}

void litteSenceRunPooPoo()
{				
				static int nCalca=0;
				switch(ppxxStep)
					{
						case 0:				
							allSenceClose();
							aurtEventUnitSence(ezhCleanSence2,1);
							_unit4(1);
							_unit11(1);
							_unit5(1);
							break;
						case 1:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*3,ezhCleanSence2);
							break;
						case 2:
							_unit5(0);
							_unit6(1);
							break;
						case 3:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*4,ezhCleanSence2|ppxxStep);
							break;
						case 4:
							_unit6(0);
							_unit11(0);
							_unit15(1);
							_unit9(1);
							break;
						case 5:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*6,ezhCleanSence2);
							break;
						case 6:		
							_unit15(0);
							_unit9(0);
							_unit11(1);
							_unit6(1);
							_unit7(1);
							break;
						case 7:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*6,ezhCleanSence2);
							break;
						case 8:		
							_unit11(0);
							_unit6(0);
							_unit7(0);
							_unit2(1);
							_unit12(1);
							_unit10(1);
							break;
						case 9:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*50,ezhCleanSence2);
							break;
						case 10:		
							_unit2(0);
							_unit12(0);
							_unit10(0);
							_unit4(0);
							break;
						case 11:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*2,ezhCleanSence2);
							break;
						case 12:		
							_unit3(1);
							break;
						case 13:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*15,ezhCleanSence2);
							break;
						case 14:		
							_unit3(0);
							break;
						

						default: //完毕
							aurtEventUnitSence(ezhCleanSence2,0);
							allOutClose();
							g_cCleanCurrentSence=0;  		//场景复位
							ppxxStep=0;
							break;
					}
}

void litteSenceRunHuWai(void)
{		
				static int nCalca=0;
				switch(ppxxStep)
					{
						case 0:				
							allSenceClose();
							aurtEventUnitSence(ezhCleanSence3,1);
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*10,ezhCleanSence3);
							break;
						case 1:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*10,ezhCleanSence3);
							break;
						default: //完毕
							aurtEventUnitSence(ezhCleanSence3,0);
							allOutClose();
							g_cCleanCurrentSence=0;  		//场景复位
							ppxxStep=0;
							break;
					}
}
void litteSenceRunChongXi(void)
{
				static int nCalca=0;
				switch(ppxxStep)
					{
						case 0:							
							allSenceClose();				
							aurtEventUnitSence(ezhCleanSence4,1);
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*10,ezhCleanSence4);
							break;
						case 1:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*10,ezhCleanSence4);
							break;
						case 2:	
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*10,ezhCleanSence4);
							break;						
						default: //完毕
							aurtEventUnitSence(ezhCleanSence4,0);
							allOutClose();						
							g_cCleanCurrentSence=0;  		//场景复位
							ppxxStep=0;
							break;
					}
}

/********************************
//烘干
*********************************/
void litteSenceRunHongGan(void)
{
				static int nCalca=0;
				switch(ppxxStep)
					{
						case 0:				
							allSenceClose();
							aurtEventUnitSence(ezhCleanSence5,1);
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*1,ezhCleanSence5);
							break;
						case 1:
							_unit2(1);
							_unit12(1);
							_unit10(1);
							break;
						case 2:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*50,ezhCleanSence5);
							break;
						case 3:
							_unit2(0);
							_unit12(0);
							_unit10(0);
							_unit1(1);
							break;
						case 4:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*15,ezhCleanSence5);
							break;
						case 5:
							_unit1(0);
							break;
						
						
						
						
						default: //完毕
							aurtEventUnitSence(ezhCleanSence5,0);
							allOutClose();						
							g_cCleanCurrentSence=0;  		//场景复位
							ppxxStep=0;
							break;
					}
}

/********************************
//除菌
*********************************/
void litteSenceRunChuQun(void)
{
				static int nCalca=0;
				switch(ppxxStep)
					{
						case 0:					
							allSenceClose();						
							aurtEventUnitSence(ezhCleanSence6,1);
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*3,ezhCleanSence6);
							break;
						case 1:
							_unit12(1);
							_unit8(1);
							_unit2(1);
							_unit10(1);
							_unit4(1);
							break;
						case 2:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*5,ezhCleanSence5);
							break;
						case 3:
							_unit15(1);
							_unit9(1);
							break;
						case 4:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*3,ezhCleanSence5);
							break;
						case 5:
							_unit15(0);
							_unit9(0);
							break;
						case 6:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*50,ezhCleanSence5);
							break;
						case 7:
							_unit15(1);
							_unit9(1);
							break;
						case 8:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*3,ezhCleanSence5);
							break;
						case 9:
							_unit15(0);
							_unit9(0);
							break;
						case 10:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*50,ezhCleanSence5);
							break;
						case 11:
							_unit15(1);
							_unit9(1);
							break;
						case 12:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*3,ezhCleanSence5);
							break;
						case 13:
							_unit15(0);
							_unit9(0);
							break;
						case 14:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*50,ezhCleanSence5);
							break;
						case15:
							_unit2(0);
							_unit4(0);
							_unit3(1);
							_unit1(1);
							_unit12(0);
							_unit8(0);
							_unit10(0);
							break;
						case 16:
							senceDelay(&nCalca,&ppxxStep,1,DEF_TIME_MS_DELAY*15,ezhCleanSence5);
							break;
						case 17:
							_unit3(0);
							_unit1(0);
							break;
						
						
						default: //完毕
							aurtEventUnitSence(ezhCleanSence6,0);
							allOutClose();
							g_cCleanCurrentSence=0;  		//场景复位
							ppxxStep=0;
							break;
					}
}

/********************************
//按摩
*********************************/
void litteSenceRunAnMo(void)
{

}

/********************************
//保暖
*********************************/
void litteSenceRunBaoNang(void)
{
	
}

